VGH/src/ExchangePlans/ОбменсСайтом/ОбменсСайтом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="3e740937-75ca-4113-8080-4a93ba0b2e09">
  <name>ОбменсСайтом</name>
  <attributes>
    <name>АдресСайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СайтПодключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

VGH/src/ExchangePlans/ОбменсСайтом/ManagerModule.bsl
Функция ПолучитьПараметрыАктивногоСайта()  Экспорт
Параметры=Новый Структура("Наименование,HTTPСервер,ИмяПользователя,Пароль,GUID,Порт");
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ОбменсСайтом.Ссылка КАК Ссылка,
|	ОбменсСайтом.Наименование КАК Наименование,
|	ОбменсСайтом.АдресСайта КАК HTTPСервер,
|	ОбменсСайтом.ИмяПользователя КАК ИмяПользователя,
|	ОбменсСайтом.Пароль КАК Пароль,
|	ОбменсСайтом.Токен КАК GUID,
|	ОбменсСайтом.СайтПодключен КАК СайтПодключен,
|	0 КАК Порт
|ИЗ
|	ПланОбмена.ОбменсСайтом КАК ОбменсСайтом
|ГДЕ
|	ОбменсСайтом.СайтПодключен
|	И НЕ ОбменсСайтом.ПометкаУдаления";

РезультатЗапроса = Запрос.Выполнить();
Если РезультатЗапроса.Пустой() Тогда
	Возврат Параметры;
КонецЕсли; 
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	ЗаполнитьЗначенияСвойств(Параметры,Выборка);
	Параметры.Вставить("Пароль",ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Выборка.Ссылка, "Пароль"));
	Прервать;
КонецЦикла;
Возврат Параметры;	

	
КонецФункции
